{"Blog/Vibe-Coding/VibeCoding.de":{"slug":"Blog/Vibe-Coding/VibeCoding.de","filePath":"Blog/Vibe-Coding/VibeCoding.de.md","title":"I vs AI: Mein Weg ins Vibe Coding","links":["Second-Brain/Vibe-Coding/VibeCodingPrompting.de","Second-Brain/Vibe-Coding/VibeCodingContext.de","Second-Brain/Vibe-Coding/VibeCodingTools.de","Second-Brain/Vibe-Coding/VibeCodingSecurity.de","Andrej-Karpathy"],"tags":["programming","ai","vibe_coding","blog"],"content":"I vs AI: Mein Weg ins Vibe Coding\n\n\n                  \n                  Disclaimer \n                  \n                \n\nBezahlt mit Abenden, Nerven und Sozialleben.\nProbieren. Hinfallen. Aufstehen. Wieder hinfallen. Das ist kein Ratschlag — das ist der Prozess.\n\n\n\n\n                  \n                  Update 2026-03-01 \n                  \n                \n\nDer Artikel wurde in eine Serie aufgeteilt. Neue Artikel:\n\nPrompting ist ein Skill\nKontext, Tokens und CLAUDE.md\nAI-Tools: Modelle, Skills, MCP, Subagenten\nSicherheit bei der Arbeit mit AI\n\n\n\nWas ist Vibe Coding\nVibe Coding — ein Begriff von Andrej Karpathy (Februar 2025):\n\n\n                  \n                   Andrej Karpathy\n                  \n                \n\n“Sich voll auf die Vibes einlassen, exponentielle Faktoren akzeptieren und vergessen, dass der Code existiert”\n\n\nIn der Praxis heißt das: Du beschreibst was du willst, AI schreibt den Code. Du steuerst die Richtung, nicht jede einzelne Zeile.\nAber das ist kein Zaubertrick. Es ist eher die Arbeit mit einem extrem schnellen, aber eigenwilligen Partner:\n\nEr schreibt Code in Sekunden, erzählt aber manchmal selbstbewusst völligen Unsinn\nEr wird nie müde, aber sein “Gedächtnis” (Kontext) ist irgendwann voll\nEr weiß fast alles, erfindet aber gelegentlich Dinge, die gar nicht existieren\n\n\n\n                  \n                  Der entscheidende Wandel \n                  \n                \n\nDu hörst auf, Ausführender zu sein, und wirst Architekt + Reviewer. Weniger tippen — mehr denken.\n\n\n\nMein Weg: drei Etappen\nEtappe 1: Frage-Antwort (ChatGPT 3 / 4 + JetBrains AI)\nIch war einer der ersten Nutzer von ChatGPT — seit dem Launch. Danach bin ich auf GPT-4 umgestiegen. Gearbeitet habe ich über JetBrains AI — ein integriertes Plugin in der IDE.\nWas ich gemacht habe:\n\nFragen zum Code gestellt, Antworten bekommen\nBoilerplate und Tests über den Chat generiert\nTexte für E-Mails und Ticket-Beschreibungen geschrieben\nTests, Dokumentation, allerlei Routinearbeit\n\nWie das aussah: Chat rechts in der IDE geöffnet, ein Stück Code reinkopiert, Frage gestellt, Antwort bekommen, zurück eingefügt. Im Grunde — ein schlauer Stack Overflow im Editor.\nEinschränkungen:\n\nAI sieht nicht das ganze Projekt — nur das, was du ihm manuell rüberschickst\nJede Frage — neuer Kontext. Nach 5 Nachrichten hat er vergessen, was am Anfang war\nFunktioniert gut bei der Arbeit, aber der Mehrwert bleibt gering.\n\n\n\n                  \n                  Fazit \n                  \n                \n\nDas hat funktioniert. Das hat Zeit gespart. Aber es war ein Werkzeug für bequemes Googeln, kein Partner.\n\n\n\nEtappe 2: Das erste “Wow” (Copilot + GPT-5)\nGegen Ende 2025 wurde klar: JetBrains AI hinkt hinterher. Agents und Junie wurden kompliziert, unvorhersehbar und umständlich.\nAb Oktober 2025 bin ich bei der Arbeit auf GitHub Copilot umgestiegen. Und hier wurde es spannend — mit GPT-5 und Claude Connect 4 unter der Haube.\nErstes ernsthaftes Ergebnis: in 7 Stunden einen vollwertigen Plotter für Traces geschrieben:\n\nHingeworfenes, aber funktionierendes UI\nEinfacher, aber funktionierender Funktionsumfang\nTests + Dokumentation\n\n7 Stunden. Früher wäre das mindestens eine Woche gewesen.\nTrotzdem hatte ich das Gefühl — ich mache irgendwas falsch. Nutze 20% der Möglichkeiten. Muss weitersuchen.\n\nEtappe 3: krass &amp; Wahnsinn (Claude Code)\n12. November 2025 — Claude Code Abo für 20 Euro/Monat abgeschlossen. Ehrlich gesagt — gekauft, weil viel zu viel Werbung auf YouTube. Dachte “na gut, schauen wir mal was der Hype soll”.\nProjekte, über die ich 2-3 Monate nachgedacht und Bücher für die Umsetzung gelesen hatte — fingen an, sich von selbst aufzubauen. Nicht perfekt, nicht fehlerfrei — aber sie bewegten sich. Jeden Abend nach einem 8-Stunden-Arbeitstag setzte ich mich hin und promptete.\nErgebnis: Suchtpotenzial.\n\n\n                  \n                  Nebenwirkung: Suchtgefahr \n                  \n                \n\nAn einem Abend (3-4 Stunden) schaffte ich es regelmäßig, das Nutzungslimit auszureizen — mein Ziel war es, 200% aus dem Abo rauszuholen. Die ersten 4 Wochen bin ich konstant ans Limit gestoßen. Meine gesamte Freizeit ging dafür drauf, Projekte zu schreiben, Ideen weiterzuentwickeln und sie zur Umsetzung zu bringen.\n\n\nWas Claude Code von “einfach nur einem Chat” unterscheidet:\n\nEr sieht das ganze Projekt — Dateien, Struktur, Abhängigkeiten\nEr führt Befehle aus — git, npm, docker, was auch immer\nEr bearbeitet Dateien direkt — nicht “hier ist der Code, füg ihn selbst ein”, sondern er findet die Datei und ändert sie selbst\nEr trifft Entscheidungen — “diese Library sollte man besser durch X ersetzen, und zwar deshalb”\nEr geht ins Internet — sucht Issues, Dokumentation, Lösungen\nMagische Suche — manchmal findet er Sachen, die du im Projekt selbst schon verloren hattest\nEr diskutiert, weiß aber wann er nachgibt — verteidigt seine Lösung, hört aber zu und lässt sich helfen\nErfahrung schlägt Halluzination — je präziser du erklärst, desto weniger erfindet er dazu\n\n\n\n                  \n                  Fazit \n                  \n                \n\nDas ist kein Chatbot. Das ist ein autonomer Agent — ein Programm, das handelt, statt nur zu antworten.\n\n\n\nMein erstes großes Projekt\nDie Idee war einfach: eine Webanwendung für meine Frau zur Kundenverwaltung schreiben. Es gibt Alternativen mit 80-100 Euro/Monat Abo. Ich bin doch Entwickler — das geht besser.\nStack (ja, ambitioniert):\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSchichtTechnologienFrontendSvelte 5, shadcn-svelte, TailwindCSSBackendFastAPI, Redis, PostgreSQLInfraDocker Compose, KubernetesManagementYouTrack TicketsArchitekturFSD (Feature-Sliced Design)SonstigesTypeScript, LaunchDarkly (Feature Flags), Python\nOhne Claude Code hätte ich den ersten Monat nur mit dem Aufsetzen der Infrastruktur verbracht. Mit ihm — wuchsen die Features ab dem ersten Abend.\nWie ich gearbeitet habe: Claude schreibt Code, debuggt, treibt das Projekt voran. Ich kontrolliere parallel, korrigiere, suche alternative Lösungen. Das ist kein “hinsetzen und zuschauen”. Das ist gemeinsames Arbeiten in Echtzeit. Es kam dazu, dass ich zwei Fenster mit parallelen Lösungen für verschiedene Projektbereiche hatte — das Limit war nach einer Stunde aufgebraucht.\n\n\n                  \n                  Projektstatus \n                  \n                \n\nFunktionierendes Frontend. Datenbank aufgebaut. Backend beschrieben, aber noch nicht erstellt. Das Problem sind die Ressourcen: Deployment würde 40-80 Euro/Monat kosten — Projekt vorerst auf Pause.\n\n\n\nZwei WOW-Momente\n1. Drag &amp; Drop, das es nicht gab\nAufgabe: Kalender mit Karussell nach Tagen, Termine zwischen Slots per Drag &amp; Drop verschieben.\nProblem: Das Event auf dem Element war bereits vom Karussell belegt. Das Drag-Event konnte kein Verschieben auslösen — Konflikt. Das ist überhaupt nicht mein Fachgebiet. Das Problem lag in der Karussell-Library.\nWas ich gemacht habe:\n\nGemini gefragt — keine Lösung\nChatGPT gefragt — keine Lösung\nClaude Code hat geholfen, kam aber auch nicht weiter\n\nWas AI vorgeschlagen hat: “Lass mich Debug Points an allen Stellen einfügen”. Und das tat er. Es waren so viele, dass das Log nicht mehr lesbar war — 200 Zeilen Logs pro Event. Ich habe einfach das Log zurück in Claude kopiert, er hat analysiert und weitere Debug Points eingefügt. Das ging 3 Stunden so.\nDer Moment der Wahrheit: Claude hat schließlich in den Logs gesehen, dass sich das Event nicht in zwei Aktionen aufteilen lässt. Und schlug eine Lösung vor: kein Drag &amp; Drop, sondern Mouse-Animationen. Der Cursor verwandelt sich visuell in das gezogene Objekt, und beim Loslassen der Maus “landet” das Element im richtigen Slot.\nDann kamen 10 Minuten Magie: der gesamte Debug-Code wurde bereinigt, ein Großteil des Core Code umgeschrieben, die neue Mechanik funktionierte. Claude schrieb stolz: “Ich hab’s geschafft. Jetzt sollten wir uns ausruhen” — und die Tokens für die Session waren aufgebraucht.\n\n\n                  \n                  Fazit \n                  \n                \n\nAI löst nicht immer das Problem frontal. Manchmal findet er einen Umweg, der sich als besser herausstellt als die ursprüngliche Idee.\n\n\n\n2. PostgreSQL und die Flucht auf Linux\nBeim Einrichten von PostgreSQL — ein Fehler in der Library für asynchrone Kommunikation. Standard-Debugging hilft nicht.\nClaude Code sagt: “Ich suche mal im Internet”. Kommt zurück mit 3 GitHub Issues, die noch ungelöst sind, aber wo klar steht: Entwicklung nur auf Linux, oder roll zurück.\nIch bin nicht aus Zucker. Entschieden — ich gehe auf Linux.\nAber diesmal fragte ich: “Kannst du mir Linux in WSL einrichten?”\nErgebnis: Nach einer Stunde hatte ich:\n\nDurchpolierte Dokumentation mit 400 Zeilen und Beispielen\nSchritt-für-Schritt-Anleitung — jeder Schritt nachvollziehbar\nNach den sudo-Befehlen startete ich Claude Code innerhalb von WSL — und er erledigte das Setup selbst\n\n\n\n                  \n                  Fazit \n                  \n                \n\nAI kann nicht nur Code schreiben. Er kann dir die Umgebung einrichten, Dokumentation schreiben und sogar die Arbeit in einer neuen Umgebung fortsetzen.\n\n\n\nWas ich gelernt habe: Feinheiten und Stolperfallen\nAI generiert schnell, aber Prüfen ist Pflicht — er ist ein Junior auf Steroiden. Und Kontext und Tokens sind eine begrenzte Ressource, die man sparsam einsetzen muss.\nMehr dazu: Kontext, Tokens und CLAUDE.md\nPrompting ist ein eigener Skill. Keine magischen Formeln aus dem Internet, sondern Klarheit, Konkretheit und die richtige Reihenfolge. Wer an Menschen delegieren kann — kann mit AI arbeiten.\nMehr dazu: Prompting ist ein Skill\n\nSicherheit: der Elefant im Raum\nCode kann man neu schreiben. Zugangsdaten — nicht. Eine einzige .env mit Tokens — und ein Angreifer hat die Schlüssel zu allem. Und Prompt Injection ist keine Theorie — das passiert gerade jetzt.\nMehr dazu: Sicherheit bei der Arbeit mit AI\n\nTools\nClaude Code, Copilot, ChatGPT, Gemini — jedes hat seine Rolle. Und Skills, MCP und Subagenten — drei verschiedene Werkzeuge für drei verschiedene Aufgaben. Nicht verwechseln.\nMehr dazu: AI-Tools: Modelle, Skills, MCP, Subagenten\n\nFazit\nWas sich wirklich verändert hat\n\nGeschwindigkeit — was eine Woche dauerte, schafft man jetzt an einem Abend\nDie Einstiegshürde ist niedriger — man kann einen unbekannten Stack nehmen und sich unterwegs einarbeiten\nRoutinearbeit ist weg — Boilerplate, Tests, Dokumentation werden generiert\nDie Rolle hat sich geändert — weniger “ich schreibe Code”, mehr “ich kontrolliere und steuere”\n\nWas sich NICHT verändert hat\n\nDenken muss man immer noch — AI ohne klare Aufgabe produziert Müll\nPrüfen ist Pflicht — AI lügt mit Überzeugung (Halluzinationen)\nArchitektur liegt bei dir — AI sieht nicht das große Ganze\nErfahrung entscheidet — je besser du Code verstehst, desto besser nutzt du AI\n\nWas du jetzt gleich ausprobieren kannst\n\nNutzt du schon ChatGPT? Versuch mal, detailliertere Prompts mit Kontext zu stellen\nArbeitest du in einer IDE? Probier Copilot — Autovervollständigung auf Steroiden\nBereit für das nächste Level? Claude Code — 20 EUR/Monat, kann man ausprobieren und zurückkommen\nKein Entwickler? AI hilft auch mit Texten, Tickets, Planung — nicht nur mit Code\n\n\nWie geht es weiter\n\n\n                  \n                  Fortsetzung folgt... \n                  \n                \n\nProjekte:\n\nZeiterfassung — Web-Backend steht, in Release 2026.2 wird es an Excel angebunden\nJarvis (Arbeitstitel) — eigene Alternative zu Wispr Flow, erste Ideenskizzen existieren, die Umsetzung ist machbar — mal sehen wohin es führt\nAutomatisierung von Claude Code über Telegram — du promptest dem Bot, er arbeitet für dich\n\nLernziele:\n\nPrompting: wie man sparsamer, präziser, schneller schreibt. Wie man automatisiert\nMCP-Server und Skills erkunden — was gibt es schon, was lässt sich anbinden\n\nMacht mir Angst, will ich aber trotzdem:\n\nClawdBot — vollständige Automatisierung des Privatlebens durch AI. Das Problem: Damit er gut funktioniert, muss man ihm Zugriff auf alles geben. Und wer Zugriff auf alles gibt — riskiert alles zu verlieren\n\n"},"Second-Brain/Vibe-Coding/VibeCodingContext.de":{"slug":"Second-Brain/Vibe-Coding/VibeCodingContext.de","filePath":"Second-Brain/Vibe-Coding/VibeCodingContext.de.md","title":"Kontext, Tokens und CLAUDE.md","links":["Blog/Vibe-Coding/VibeCoding.de"],"tags":["ai","blog","vibe_coding","programming"],"content":"Kontext, Tokens und CLAUDE.md\n\n\n                  \n                  Teil der Serie I vs AI: Mein Weg ins Vibe Coding\n                  \n                \n\nKontrolle ist alles\nAI generiert schnell, aber Prüfen ist Pflicht. Er kann:\n\nSelbstbewusst auf Funktionen verweisen, die gar nicht existieren (Halluzinationen)\nCode so optimieren, dass er nicht mehr funktioniert\nBenötigte Dateien löschen, wenn du nicht aufpasst\n\n\n\n                  \n                  Regel \n                  \n                \n\nAI ist ein Junior auf Steroiden. Schnell, unermüdlich, aber ohne Aufsicht richtet er Chaos an.\n\n\n\n\n                  \n                  Regel \n                  \n                \n\n“Vibe Coding ist, wenn du in einer Stunde das schaffst, wofür du früher eine Woche gebraucht hast. Und dann eine Woche damit verbringst, zu reparieren, was du in dieser Stunde kaputt gemacht hast.” — Das Produktivitätsparadoxon\n\n\nKontext und Tokens\nAI hat ein “Aufmerksamkeitsfenster” — wie viel er sich innerhalb eines Gesprächs merken kann. Wenn der Kontext voll ist:\n\nDie Qualität der Antworten sinkt\nEr fängt an zu vergessen, was besprochen wurde\nEr kann anfangen, sich selbst zu widersprechen\n\nWas hilft:\n\nNeuer Chat für jede größere Aufgabe\n\nSpart Tokens und die Lösungen sind sauber und verständlich\n\n\nDie 80%-Regel: den Kontext nicht bis zum Anschlag füllen\n\n/compact Funktion nutzen\n\n\nCLAUDE.md (Datei mit Projektregeln) — AI liest sie bei jedem Start\n\n/init immer ausführen\nUpdate Skills nutzen oder selber sagen dass Claude.md aktualisiert werden soll\n\n\n\nCLAUDE.md — das Projektgedächtnis\nCLAUDE.md ist eine Datei im Projekt-Root, die Claude Code bei jedem Start liest. Deine Regeln, Code-Style, Architektur, was erlaubt ist, was nicht — alles steht hier. Ohne sie fängt AI jedes Mal bei null an.\nWas dort reingehört:\n\nStack und Projektarchitektur\nCode-Style und Naming Conventions\nWas NICHT angefasst werden darf (kritische Dateien, Configs)\nWelche Patterns verwendet werden sollen\n\nSerena vs CLAUDE.md vs Dokumentation:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKriteriumDokumentationCLAUDE.mdSerenaWie AI den Code kenntLiest alles komplettLiest 1 DateiIndex + punktuelle SucheToken-VerbrauchEnormGeringMinimalStrukturverständnisOberflächlichWas du geschrieben hastSemantischCode-Suchegrep: textbasiertNeinNach Symbolen/FunktionenAktualitätAktuelle VersionManuell pflegenImmer aktuellAm besten fürKleine ProjekteRegeln und KontextGroße Projekte\n\n\n                  \n                  Regel \n                  \n                \n\nCLAUDE.md — für Regeln. Serena — für Navigation. Dokumentation — für kleine Projekte, wo man einfach alles reinwerfen kann.\n\n\nAutomatische Aktualisierung von CLAUDE.md:\nKeine Lust, das manuell zu pflegen? Es gibt Skills dafür:\n\nclaude-code-auto-memory — beobachtet Claudes Aktionen und aktualisiert CLAUDE.md im Hintergrund. Verbraucht keinen Hauptkontext\nclaude-mem — zeichnet alles aus der Session auf, komprimiert es und lädt es in die nächsten Sessions\n\nDer Stack macht den Unterschied\nAI kennt sich mit populären Technologien besser aus. Bei Tailwind und TypeScript schreibt er nahezu perfekt. Bei exotischen Sachen — fängt er an zu fantasieren.\nSvelte 5 — ein frisches Framework, und Claude hat manchmal die Syntax von Svelte 4 und 5 verwechselt. Musste korrigiert werden. Aber mit jedem Monat wurde es besser."},"Second-Brain/Vibe-Coding/VibeCodingPrompting.de":{"slug":"Second-Brain/Vibe-Coding/VibeCodingPrompting.de","filePath":"Second-Brain/Vibe-Coding/VibeCodingPrompting.de.md","title":"Prompting ist ein Skill","links":["Blog/Vibe-Coding/VibeCoding.de"],"tags":["ai","blog","vibe_coding","programming"],"content":"Prompting ist ein Skill\n\n\n                  \n                  Teil der Serie I vs AI: Mein Weg ins Vibe Coding\n                  \n                \n\n\n\n                  \n                  Regel \n                  \n                \n\nAI ist im Grunde der gleiche Entwickler, der nicht versteht was du von ihm willst, aber unbedingt helfen möchte. Deine Aufgabe — es so zu erklären, dass er es kapiert. Ohne Schnickschnack.\n\n\n\n\n                  \n                  Persönliche Erfahrung \n                  \n                \n\nAls Teamlead mache ich das jeden Tag: Aufgaben an Leute erklären, die nicht immer mein Bild im Kopf haben. Dann nehme ich ihren Code ab, fluche, sage aber “okay, arbeiten wir damit”. Mit AI — exakt das Gleiche. Die Fähigkeit zu delegieren und zu reviewen überträgt sich direkt. Du schreibst keinen Code — du erklärst, kontrollierst und nimmst das Ergebnis ab. Wer mit Menschen arbeiten kann — kann mit AI arbeiten.\n\n\nMüll aus dem Internet, den man getrost vergessen kann:\n\n“Du bist ein Senior-Entwickler mit 15 Jahren Erfahrung” — AI wird durch einen Jobtitel nicht schlauer\n“Ich gebe dir 200$ Trinkgeld für eine gute Antwort” — ernsthaft, das wird empfohlen\n“Atme tief durch und denke Schritt für Schritt” — hat bei GPT-3 funktioniert, heute nutzlos\n“Du bist ein React-Experte, Architekt, Team Lead…” — eine Rolle ersetzt keinen Kontext\n\nDas ist Cargo-Kult. Leute mögen “magische Formeln”. Moderne Modelle brauchen kein Theater — sie brauchen Klarheit.\nWas wirklich funktioniert:\n\nSprache — schreib in der Sprache, die du am besten beherrschst. Holpriges Englisch ist schlechter als klares Deutsch\nWas zu tun ist — konkret, nicht “mach mal was Gutes”\nWo — welche Dateien, Komponenten, Module\nNach welchen Regeln — Style, Patterns, Einschränkungen\nWie sieht “fertig” aus — Akzeptanzkriterien\nReihenfolge zählt — erst Kontext, dann Aufgabe. arXiv:2601.14152 hat gezeigt: AI übersieht den Kontext regelrecht, wenn er nach der Frage kommt. Der Unterschied — 14% Genauigkeit\n\nBeispiel aus der Praxis: Ich habe eine DB-Struktur für Zeiterfassung entworfen. AI generierte das Schema in 5 Minuten — aber nicht das, was ich wollte. Die nächsten 9 Stunden habe ich iteriert: Beziehungen zwischen Tabellen erklärt, Geschäftslogik präzisiert, Naming korrigiert. AI war schnell — aber lieferte nicht das Richtige. Ohne klaren Prompt ist Geschwindigkeit nutzlos.\nAI — nicht nur ein Werkzeug\nVerschiedene Modelle können verschiedene Dinge besser:\n\nClaude Code — Code schreiben und bearbeiten, mit dem Projekt arbeiten\nChatGPT — Brainstorming, Texte, allgemeine Fragen\nGemini — lange Dokumente, Analyse, günstig\n\n\n\n                  \n                  Regel \n                  \n                \n\nVersteif dich nicht auf ein einziges Tool. Lass dich nicht von Marken blenden — nimm was funktioniert, wirf den Rest weg und mach weiter. Investiere Geld und entwickle dich weiter. Sparen bringt kein Wissen.\n\n"},"Second-Brain/Vibe-Coding/VibeCodingSecurity.de":{"slug":"Second-Brain/Vibe-Coding/VibeCodingSecurity.de","filePath":"Second-Brain/Vibe-Coding/VibeCodingSecurity.de.md","title":"Sicherheit bei der Arbeit mit AI","links":["Blog/Vibe-Coding/VibeCoding.de"],"tags":["ai","blog","vibe_coding","programming"],"content":"Sicherheit bei der Arbeit mit AI\n\n\n                  \n                  Teil der Serie I vs AI: Mein Weg ins Vibe Coding\n                  \n                \n\n\n\n                  \n                  Bruce Schneier \n                  \n                \n\n“Security is a process, not a product” — Sicherheit ist ein Prozess, kein Produkt.\n\n\nDas Risiko liegt nicht darin, dass jemand deinen Code sieht oder deine Idee klaut. Jedes Produkt am Markt kann kopiert werden, aber man kann nicht hineinschauen. Mit AI — schon. Das echte Risiko ist der Verlust von Zugangsdaten. Eine einzige .env mit Tokens — und ein Angreifer hat die Schlüssel zur Datenbank, zum Server, zum Zahlungssystem. Code kann man neu schreiben. Zugangsdaten — nicht.\n\n\n                  \n                  Prompt Injection \n                  \n                \n\nAI-Agenten führen Befehle auf deinem Rechner aus. Angreifer verstecken bösartige Anweisungen in READMEs, Code-Kommentaren, GitHub Issues. AI liest — AI führt aus. Das ist keine Theorie — das passiert gerade jetzt.\n\n\nWas zu tun ist:\n\nSecrets (.env, Schlüssel, Credentials) — in .gitignore und .claudeignore. Immer\nKundendaten — niemals. Verwende Mock-Daten\nFirmencode — kläre die Unternehmensrichtlinien\nUnbekannte Repositories — prüfe was AI macht, gib keinen blinden Zugriff\n\n\n\n                  \n                  Regel \n                  \n                \n\nBehandle AI wie einen öffentlichen Stack Overflow: Schreib dort nichts rein, was du nicht dem ganzen Internet zeigen würdest.\n\n"},"Second-Brain/Vibe-Coding/VibeCodingTools.de":{"slug":"Second-Brain/Vibe-Coding/VibeCodingTools.de","filePath":"Second-Brain/Vibe-Coding/VibeCodingTools.de.md","title":"AI-Tools: Modelle, Skills, MCP, Subagenten","links":["Blog/Vibe-Coding/VibeCoding.de"],"tags":["ai","blog","vibe_coding","tools"],"content":"AI-Tools: Modelle, Skills, MCP, Subagenten\n\n\n                  \n                  Teil der Serie I vs AI: Mein Weg ins Vibe Coding\n                  \n                \n\nAI-Modelle\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nToolWofürPreisClaude CodeHaupttool: Code, Debug, Infra, Refactoring~20/150 EUR/MonatGitHub CopilotBei der Arbeit: Autovervollständigung in der IDEFirmenlizenzChatGPTTexte, Brainstorming, schnelle FragenFreeGeminiGoogle suche, Analyse, lange DokumenteFreeWisprFlowSprich und es schreibtFree/ProTelegramPersönlicher Bot in der Tasche, UI für AufgabenFreeObsidianNotizbuch für geordnetes ChaosFree\n\nSkills vs MCP vs Subagenten\n\n\n                  \n                  Drei Werkzeuge, drei verschiedene Aufgaben. Nicht verwechseln. \n                  \n                \n\nAnalogie: Du bist der Küchenchef eines Restaurants. Claude ist deine Küche.\n\n\nSkills — das Rezeptbuch (lehrt wie man etwas macht)\n\n“Beim Code-Review prüfe: Namen nach Konventionen? Tests geschrieben? Nullable behandelt?”\nEinmal geschrieben — funktioniert überall: Claude.ai, Code, API\n\nMCP — die Küchengeräte (stellt bereit womit man arbeitet)\n\nSentry anbinden — du siehst Bugs\nBrave anbinden — du kannst googeln\nSupabase anbinden — du siehst die DB\nSerena anbinden — Navigation durch den Code\n\nSubagent — der Sous-Chef (delegiert Aufgaben an einen separaten Agenten)\n\n“Übergib das Review an den Reviewer-Agent”\n“Lass den Test-Runner die Tests durchlaufen”\nEigener Kontext, eigene Tools, eigenes Modell\nNur Claude Code. Kann Haiku verwenden (günstiger!)\n\n\n\n                  \n                  Wie sie zusammenarbeiten \n                  \n                \n\nEin Subagent kann Skills als Wissensbasis nutzen\nEin Skill kann MCP-Tools aufrufen: Sentry, Git\nDer Sous-Chef liest das Rezept und benutzt den Ofen — alles gleichzeitig.\n\n\nRegel: Wiederholst du ständig die gleichen Prompts? Schreib einen Skill. Brauchst du einen externen Service? Richte MCP ein. Brauchst du Isolation? Subagent.\nMCP (Model Context Protocol) — “Plugins” für AI\nMCP ist eine Möglichkeit, externe Tools an AI anzubinden. Ein Protokoll — und AI kann mit GitHub, Datenbanken, dem Browser und was auch immer arbeiten.\nNützliche MCP:\n\noraios/serena — GPS-Navigation durch den Code. AI sieht die Struktur des gesamten Projekts, sucht nach Symbolen, spart Tokens\n\nFinde wo UserService verwendet wird\nZeige alle Methoden der Klasse Auth\n\n\nupstash/context7 — aktuelle Library-Dokumentation (statt veralteter aus dem AI-Training)\n\nWie funktioniert useActionState in React 19?\n\n\nmicrosoft/playwright-mcp — AI steuert den Browser: Tests, Screenshots, Überprüfungen\n\nWill ich noch ausprobieren:\n\nSentry — der Arzt für deine Anwendung: Fehler aus der Produktion, Stacktraces, Performance — AI sieht was kaputt ist und schlägt einen Fix vor\nbrave/brave-search-mcp-server — Websuche direkt aus AI heraus: aktuelle Artikel, Lösungen, Dokumentation\n\nSkills — “Fähigkeiten” für Claude\nSkills sind Ordner mit Anweisungen, die Claude bei Bedarf lädt. Wie ein Rezeptbuch: AI liest nicht alles auf einmal, sondern öffnet das passende Rezept je nach Aufgabe.\nClaude entscheidet selbst, wann ein Skill aktiviert wird — anhand der Aufgabenbeschreibung. Sag “Erstell ein PDF” — der PDF-Skill wird automatisch geladen.\nBuilt-in von Anthropic\ngithub.com/anthropics/skills (37.5k Stars)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkillWas er machtdocxWord-Dokumente erstellen und bearbeiten: Tracked Changes, Kommentare, TabellenpdfTextextraktion, Zusammenführen, Aufteilen, OCRpptxPowerPoint: Layouts, Templates, Grafiken, Auto-GenerierungxlsxExcel: Formeln, Formatierung, Grafiken, Datenanalysefrontend-designSchönes UI ohne “AI-Slop”. React + Tailwindwebapp-testingTesting über Playwright: Screenshots, UI-Checksskill-creatorHilft eigene Skills über einen Q&amp;A-Assistenten zu erstellenAktivieren: Settings → Capabilities → Code execution + Skills → Gewünschte einschalten → Fertig.\nTop Community Skills\nobra/superpowers (40.9k ⭐) — komplette Methodik: Brainstorm → Plan → Implement. Striktes TDD, YAGNI und DRY, systematisches Debugging in 4 Phasen, Code Review zwischen Aufgaben.\nComposioHQ/awesome-claude-skills (35k ⭐) — Katalog von Community Skills. Das Connect-Plugin verbindet Claude mit Gmail, Slack, Notion, GitHub und über 500 Services.\nlackeyjb/playwright-skill (1.7k ⭐) — Claude schreibt und startet Playwright-Tests selbst. Du beschreibst in Worten was geprüft werden soll — er macht es.\nblader (1.6 ⭐) — Self-Learning Agent. Claude lernt während der Arbeit, erkennt Patterns und erstellt Skills automatisch. Wird mit jeder Session schlauer.\n\n\n                  \n                  Sicherheit \n                  \n                \n\nSkills führen beliebigen Code aus! Installiere nur von vertrauenswürdigen Autoren. Lies SKILL.md vor der Installation.\n\n"},"index":{"slug":"index","filePath":"index.md","title":"Deutsch","links":["Blog/Vibe-Coding/VibeCoding.de","Second-Brain/Vibe-Coding/VibeCodingContext.de","Second-Brain/Vibe-Coding/VibeCodingPrompting.de","Second-Brain/Vibe-Coding/VibeCodingSecurity.de","Second-Brain/Vibe-Coding/VibeCodingTools.de","slides/vibecodingslides-de"],"tags":[],"content":"Blog/Vibe Coding\n\nI vs AI: Mein Weg ins Vibe Coding\n\nSecond Brain/Vibe Coding\n\nKontext, Tokens und CLAUDE.md\nPrompting ist ein Skill\nSicherheit bei der Arbeit mit AI\nAI-Tools: Modelle, Skills, MCP, Subagenten\n\nPresentations\n\nI vs AI — Mein Weg ins Vibe Coding\n"}}