{"Blog/Vibe-Coding/VibeCoding":{"slug":"Blog/Vibe-Coding/VibeCoding","filePath":"Blog/Vibe-Coding/VibeCoding.md","title":"I vs AI: мой путь в Vibe Coding","links":["Second-Brain/Vibe-Coding/VibeCodingPrompting","Second-Brain/Vibe-Coding/VibeCodingContext","Second-Brain/Vibe-Coding/VibeCodingTools","Second-Brain/Vibe-Coding/VibeCodingSecurity"],"tags":["ai","blog","vibe_coding","programming"],"content":"I vs AI: мой путь в Vibe Coding\n\n\n                  \n                  Дисклеймер \n                  \n                \n\nОплачено вечерами, нервами и личной жизнью.\nПробуй. Падай. Вставай. Снова падай. Это не совет — это процесс.\n\n\n\n\n                  \n                  Обновление 2026-03-01 \n                  \n                \n\nСтатья разбита на серию. Добавлены отдельные статьи:\n\nПромптинг — это навык\nКонтекст, токены и CLAUDE.md\nИнструменты AI: модели, Skills, MCP, субагенты\nБезопасность при работе с AI\n\n\n\nЧто такое Vibe Coding\nVibe Coding — термин Андрея Карпатого (февраль 2025):\n\n\n                  \n                  Андрей Карпатый \n                  \n                \n\n“Полностью отдаться вибрациям, принять экспоненциальные коэффициенты и забыть о существовании кода”\n\n\nНа практике это значит: ты описываешь что хочешь, AI пишет код. Ты контролируешь направление, а не каждую строчку.\nНо это не магическая кнопка. Это скорее работа с очень быстрым, но своеобразным напарником:\n\nОн пишет код за секунды, но иногда уверенно несёт чушь\nОн не устаёт, но у него заканчивается “память” (контекст)\nОн знает почти всё, но иногда выдумывает то, чего не существует\n\n\n\n                  \n                  Ключевой сдвиг \n                  \n                \n\nТы перестаёшь быть исполнителем и становишься архитектором + ревьюером. Меньше печатаешь — больше думаешь.\n\n\n\nМой путь: три этапа\nЭтап 1: Вопрос-ответ (ChatGPT 3 / 4 + JetBrains AI)\nЯ был одним из первых пользователей ChatGPT — с самого запуска. Потом перешёл на GPT-4. Работал через JetBrains AI — встроенный плагин в IDE.\nЧто делал:\n\nСпрашивал вопросы по коду, получал ответы\nГенерировал бойлерплейт, тесты через чат\nПисал тексты для email-ов и описания тикетов\nТесты, документация, всякая рутина\n\nКак это выглядело: открыл чат справа в IDE, скопировал кусок кода, задал вопрос, получил ответ, вставил обратно. По сути — умный Stack Overflow внутри редактора.\nОграничения:\n\nAI не видит весь проект — только то, что ты ему вручную скинул\nКаждый вопрос — новый контекст. Через 5 сообщений он забывает что было в начале\nХорошо работает на работе но результат малый.\n\n\n\n                  \n                  Итог \n                  \n                \n\nЭто работало. Это экономило время. Но это был инструмент для ленивых гуглов, а не напарник.\n\n\n\nЭтап 2: Первый “ого” (Copilot + GPT-5)\nБлиже к концу 2025 стало понятно: JetBrains AI отстал. Agents и Junie стали сложными, непредсказуемыми и неудобными.\nС октябре 2025 перешёл на GitHub Copilot на работе. И тут стало интереснее — уже GPT-5 и Claude Connect 4 под капотом.\nПервый серьёзный результат: за 7 часов написал полноценный Plotter для трейсов:\n\nНабросанный, но рабочий UI\nПростой, но работающий функционал\nТесты + документация\n\n7 часов. Раньше это была бы неделя минимум.\nНо всё равно чувствовал — я что-то делаю не так. Использую 20% возможностей. Надо искать.\n\nЭтап 3: Взрыв мозга (Claude Code)\n12 ноября 2025 — купил подписку Claude Code за 20 евро/мес. Честно — купил потому что слишком много рекламы на YouTube. Думал “ну посмотрю что за хайп”.\nПроекты, которые я обдумывал по 2-3 месяца, читал книги для реализации — начали строиться сами. Не идеально, не без ошибок — но они двигались. Каждый вечер после 8-часового рабочего дня я садился и промптил.\nРезультат: наркотик.\n\n\n                  \n                  Побочный эффект: зависимость \n                  \n                \n\nЗа вечер (3-4 часа) я умудрялся выбивать лимит по использованию — моя цель была выжать 200% из подписки. Первые 4 недели я стабильно упирался в потолок. Всё свободное время уходило на то, чтобы писать проекты, развивать свои идеи и доводить их до реализации.\n\n\nЧем Claude Code отличается от “просто чата”:\n\nОн видит весь проект — файлы, структуру, зависимости\nОн выполняет команды — git, npm, docker, всё что угодно\nОн правит файлы напрямую — не “вот тебе код, вставь сам”, а сам находит файл и меняет\nОн принимает решения — “эту библиотеку лучше заменить на X, вот почему”\nОн ходит в интернет — ищет issues, документацию, решения\nМагия поиска — иногда находит то, что ты сам уже потерял в проекте\nОн спорит, но знает когда уступить — отстаивает решение, но прислушивается и даёт себе помочь\nОпыт перевешивает шизофрению — чем точнее ты объясняешь, тем меньше он выдумывает\n\n\n\n                  \n                  Итог \n                  \n                \n\nЭто не чат-бот. Это автономный агент — программа, которая действует, а не просто отвечает.\n\n\n\nМой первый большой проект\nИдея простая: написать web-приложение для жены для учёта клиентов. Есть аналоги с подпиской 80-100 евро/мес. Я же разработчик — могу лучше.\nСтек (да, амбициозно):\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nСлойТехнологииFrontendSvelte 5, shadcn-svelte, TailwindCSSBackendFastAPI, Redis, PostgreSQLИнфраDocker Compose, KubernetesУправлениеYouTrack тикетыАрхитектураFSD (Feature-Sliced Design)ПрочееTypeScript, LaunchDarkly (фича-флаги), Python\nБез Claude Code я бы провёл первый месяц только на настройку инфры. С ним — проект начал обрастать фичами с первого вечера.\nКак я работал: Claude пишет код, дебажит, двигает проект вперёд. Я параллельно контролирую, исправляю, ищу альтернативные решения. Это не “сел и смотришь”. Это совместная работа в реальном времени. Доходило до двух окон с параллельными решениями для разных областей проекта, хватала лимита на 1 час.\n\n\n                  \n                  Статус проекта \n                  \n                \n\nРабочий фронтенд. Построена база данных. Бэкенд описан, но не создан. Проблема в ресурсах: деплой обойдётся в 40-80 евро/мес — проект пока на паузе.\n\n\n\nДва WOW-момента\n1. Drag &amp; Drop, которого не было\nЗадача: календарь с каруселью по дням, нужно перетаскивать термины между слотами.\nПроблема: событие на элементе уже занято каруселью. Drag-событие не может стригерить перетаскивание — конфликт. Это не моя область знаний вообще. Проблема в библиотеке карусели.\nЧто делал:\n\nПошёл в Gemini — не решил\nПошёл в ChatGPT — не решил\nClaude Code помогал, но тоже буксовал\n\nЧто предложил AI: “Давай я вставлю debug points во все места”. И вставил. Их было столько, что лог читать было невозможно, 200 строк логов за одно событие. Я просто копировал лог обратно в Claude, он анализировал, вставлял ещё debug points. Это продолжалось 3 часа.\nМомент истины: Claude наконец увидел в логах, что событие нельзя разделить на два действия. И предложил решение: не Drag &amp; Drop, а Mouse-анимации. Курсор визуально превращается в перетаскиваемый объект, а при отпускании мышки — элемент “приземляется” в нужный слот.\nДальше были 10 минут магии: весь debug-код вычищен, большая часть core code переписана, новая механика работает. Claude гордо написал: “Я это сделал. Теперь нам надо отдохнуть” — и закончились токены на сессию.\n\n\n                  \n                  Вывод \n                  \n                \n\nAI не всегда решает задачу в лоб. Иногда он находит обходной путь, который оказывается лучше оригинальной идеи.\n\n\n\n2. PostgreSQL и побег на Linux\nПри настройке PostgreSQL — ошибка в библиотеке асинхронной коммуникации. Стандартный дебаг не помогает.\nClaude Code говорит: “Я пойду в интернете поищу”. Возвращается с 3 GitHub Issues, которые ещё не решены, но где чётко написано: разработка только на Linux или откатывайся назад.\nЯ не из трусливых. Решил — иду на Linux.\nНо в этот раз спросил: “Можешь мне настроить Linux в WSL?”\nРезультат: через час у меня была:\n\nВылизанная документация на 400 строк с примерами\nПошаговая инструкция — каждый шаг понятен\nПосле sudo-команд я запустил Claude Code внутри WSL — и он доделал настройку сам\n\n\n\n                  \n                  Вывод \n                  \n                \n\nAI умеет не только код писать. Он может настроить тебе окружение, написать документацию и даже продолжить работу в новой среде.\n\n\n\nЧто я понял: тонкости и грабли\nAI генерирует быстро, но проверять обязательно — это джуниор на стероидах. А контекст и токены — ограниченный ресурс, который нужно уметь экономить.\nПодробнее: Контекст, токены и CLAUDE.md\nПромптинг — отдельный навык. Не магические формулы из интернета, а ясность, конкретика и правильный порядок. Кто умеет делегировать людям — умеет работать с AI.\nПодробнее: Промптинг — это навык\n\nБезопасность: слон в комнате\nКод можно переписать. Доступы — нет. Одна .env с токенами — и у злоумышленника ключи от всего. А prompt injection — это не теория, это происходит прямо сейчас.\nПодробнее: Безопасность при работе с AI\n\nИнструменты\nClaude Code, Copilot, ChatGPT, Gemini — у каждого своя роль. А Skills, MCP и субагенты — три разных инструмента для трёх разных задач. Не путай.\nПодробнее: Инструменты AI: модели, Skills, MCP, субагенты\n\nВыводы\nЧто реально изменилось\n\nСкорость — то, что занимало неделю, делается за вечер\nПорог входа ниже — можно брать незнакомый стек и разбираться по ходу\nРутина исчезла — бойлерплейт, тесты, документация генерируются\nРоль изменилась — меньше “пишу код”, больше “контролирую и направляю”\n\nЧего НЕ изменилось\n\nДумать всё ещё надо — AI без чёткой задачи пишет мусор\nПроверять обязательно — AI уверенно врёт (галлюцинации)\nАрхитектура — на тебе — AI не видит картину целиком\nОпыт решает — чем лучше ты понимаешь код, тем лучше используешь AI\n\nЧто попробовать прямо сейчас\n\nУже используешь ChatGPT? Попробуй задавать более детальные промпты с контекстом\nРаботаешь в IDE? Попробуй Copilot — автодополнение на стероидах\nГотов к следующему уровню? Claude Code — 20 EUR/мес, можно попробовать и вернуться\nНе разработчик? AI помогает и с текстами, тикетами, планированием — не только с кодом\n\n\nЧто дальше\n\n\n                  \n                  Продолжение следует... \n                  \n                \n\nПроекты:\n\nZeiterfassung — web-бэкенд готов, в релизе 2026.2 подключаю к Excel\nJarvis (рабочее название) — свой аналог Wispr Flow, наброски идей уже есть, реализация лёгкая — посмотрим куда приведёт\nАвтоматизация Claude Code через Telegram — промптишь боту, он работает за тебя\n\nУчусь:\n\nПромптинг: как писать экономнее, точнее, быстрее. Как автоматизировать\nИзучаю MCP-серверы и skills — что уже есть, что можно подключить\n\nБоюсь, но хочу:\n\nClawdBot — полная автоматизация личной жизни через AI. Проблема: чтобы он хорошо работал, нужно дать ему доступ ко всему. А кто даёт доступ ко всему — рискует потерять всё\n\n"},"Second-Brain/Vibe-Coding/VibeCodingContext":{"slug":"Second-Brain/Vibe-Coding/VibeCodingContext","filePath":"Second-Brain/Vibe-Coding/VibeCodingContext.md","title":"Контекст, токены и CLAUDE.md","links":["Blog/Vibe-Coding/VibeCoding"],"tags":["ai","blog","vibe_coding","programming"],"content":"Контекст, токены и CLAUDE.md\n\n\n                  \n                  Часть серии I vs AI: мой путь в Vibe Coding\n                  \n                \n\nКонтроль — это всё\nAI генерирует быстро, но проверять обязательно. Он может:\n\nУверенно ссылаться на функции, которых не существует (галлюцинации)\nОптимизировать код так, что он перестанет работать\nУдалить нужные файлы, если не следишь\n\n\n\n                  \n                  Правило \n                  \n                \n\nAI — это джуниор на стероидах. Быстрый, неутомимый, но без присмотра натворит дел.\n\n\n\n\n                  \n                  Правило \n                  \n                \n\n“Вайбкодинг - это когда ты за час делаешь то, что раньше делал неделю. А потом неделю чинишь то, что сломал за этот час.” — Парадокс продуктивности\n\n\nКонтекст и токены\nУ AI есть “окно внимания” — сколько он помнит за разговор. Когда контекст забивается:\n\nКачество ответов падает\nОн начинает забывать что обсуждали\nМожет начать противоречить сам себе\n\nЧто помогает:\n\nНовый чат на каждую крупную задачу\n\nЭкономит токены и решения чистые и понятные\n\n\nПравило 80%: не забивай контекст до предела\n\nИспользуй функцию /compact для сжатия контекста\n\n\nВсегда запускай /init в начале сессии\n\nИспользуй Update Skills или сам попроси Claude обновить CLAUDE.md\n\n\nCLAUDE.md (файл с правилами проекта) — AI читает его при каждом запуске\n\nCLAUDE.md — память проекта\nCLAUDE.md — это файл в корне проекта, который Claude Code читает при каждом запуске. Твои правила, стиль кода, архитектура, что можно, что нельзя — всё здесь. Без него AI каждый раз начинает с нуля.\nЧто туда писать:\n\nСтек и архитектура проекта\nКод-стайл и naming conventions\nЧто НЕ трогать (критичные файлы, конфиги)\nКакие паттерны использовать\n\nSerena vs CLAUDE.md vs Документация:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nКритерийДокументацияCLAUDE.mdSerenaКак AI узнаёт о кодеЧитает всё целикомЧитает 1 файлИндекс + точечный поискРасход токеновОгромныйМаленькийМинимальныйПонимание структурыПоверхностноеЧто ты написалСемантическоеПоиск по кодуgrep: текстовыйНетПо символам/функциямАктуальностьТекущая версияВручную обновлятьВсегда актуальноЛучше дляМаленьких проектовПравил и контекстаБольших проектов\n\n\n                  \n                  Правило \n                  \n                \n\nCLAUDE.md — для правил. Serena — для навигации. Документация — для маленьких проектов где проще скормить всё.\n\n\nАвтоматическое обновление CLAUDE.md:\nНе хочешь обновлять вручную? Есть скиллы:\n\nclaude-code-auto-memory — следит за действиями Claude и обновляет CLAUDE.md в фоне. Не тратит основной контекст\nclaude-mem — записывает всё из сессии, сжимает и подгружает в следующие сессии\n\nСтек имеет значение\nAI лучше знает популярные технологии. На Tailwind и TypeScript он пишет почти идеально. На чём-то экзотическом — начинает выдумывать.\nSvelte 5 — свежий фреймворк, и Claude иногда путал синтаксис Svelte 4 и 5. Пришлось корректировать. Но с каждым месяцем становилось лучше."},"Second-Brain/Vibe-Coding/VibeCodingPrompting":{"slug":"Second-Brain/Vibe-Coding/VibeCodingPrompting","filePath":"Second-Brain/Vibe-Coding/VibeCodingPrompting.md","title":"Промптинг — это навык","links":["Blog/Vibe-Coding/VibeCoding"],"tags":["ai","blog","vibe_coding","programming"],"content":"Промптинг — это навык\n\n\n                  \n                  Часть серии I vs AI: мой путь в Vibe Coding\n                  \n                \n\n\n\n                  \n                  Правило \n                  \n                \n\nAI — это тот же разработчик, который не понимает что ты от него хочешь, но очень хочет помочь. Твоя задача — объяснить так, чтобы он понял. Без костюма и галстука.\n\n\n\n\n                  \n                  Личный опыт \n                  \n                \n\nЯ как тим-лид каждый день этим занимаюсь: объясняю задачи людям, которые не всегда видят мою картинку. Потом принимаю их код, ругаюсь, но говорю “окей, работаем с этим”. С AI — один в один. Навык делегирования и ревью переносится напрямую. Ты не пишешь код — ты объясняешь, контролируешь и принимаешь результат. Кто умеет работать с людьми — умеет работать с AI.\n\n\nМусор из интернета, который можно забыть:\n\n“Ты — senior разработчик с 15-летним опытом” — AI не станет умнее от должности\n“Я дам тебе $200 чаевых за хороший ответ” — серьёзно, это советуют\n“Сделай глубокий вдох и подумай шаг за шагом” — работало на GPT-3, сейчас бесполезно\n“Ты — эксперт по React, архитектор, team lead…” — роль не заменяет контекст\n\nЭто карго-культ. Людям нравятся “магические формулы”. Современным моделям не нужен театр — им нужна ясность.\nЧто реально работает:\n\nЯзык — пиши на том, который знаешь лучше всего. Корявый английский хуже чёткого русского\nЧто сделать — конкретно, а не “сделай хорошо”\nГде — какие файлы, компоненты, модули\nПо каким правилам — стиль, паттерны, ограничения\nКак выглядит “готово” — критерии приёмки\nПорядок имеет значение — сначала контекст, потом задача. arXiv:2601.14152 показало: AI буквально не видит контекст, если он стоит после вопроса. Разница — 14% точности\n\nПример из жизни: писал структуру БД для учёта рабочего времени. AI сгенерировал схему за 5 минут — но не ту, что я хотел. Следующие 9 часов я итерировал: объяснял связи между таблицами, уточнял бизнес-логику, правил naming. AI делал быстро — но не то. Без чёткого промпта скорость бесполезна.\nAI — не один инструмент\nРазные модели хороши в разном:\n\nClaude Code — писать и править код, работать с проектом\nChatGPT — брейншторм, тексты, общие вопросы\nGemini — длинные документы, анализ, дёшево\n\n\n\n                  \n                  Правило \n                  \n                \n\nНе женись на одном инструменте. Не увлекайся брендами — бери то, что работает, а остальное выбрасывай и иди дальше. Трать деньги и развивайся. Экономия не принесёт знаний.\n\n"},"Second-Brain/Vibe-Coding/VibeCodingSecurity":{"slug":"Second-Brain/Vibe-Coding/VibeCodingSecurity","filePath":"Second-Brain/Vibe-Coding/VibeCodingSecurity.md","title":"Безопасность при работе с AI","links":["Blog/Vibe-Coding/VibeCoding"],"tags":["ai","blog","vibe_coding","programming"],"content":"Безопасность при работе с AI\n\n\n                  \n                  Часть серии I vs AI: мой путь в Vibe Coding\n                  \n                \n\n\n\n                  \n                  Брюс Шнайер \n                  \n                \n\n“Security is a process, not a product” — Безопасность — это процесс, а не продукт.\n\n\nРиск не в том, что кто-то увидит твой код или украдёт идею. Любой продукт на рынке можно скопировать, но нельзя заглянуть внутрь. А с AI — можно. Настоящий риск — утечка доступов. Один .env с токенами — и у злоумышленника ключи от базы, сервера, платёжки. Код можно переписать. Доступы — нет.\n\n\n                  \n                  Prompt Injection \n                  \n                \n\nAI-агенты выполняют команды на твоём компьютере. Злоумышленники прячут вредоносные инструкции в README, комментариях кода, issue на GitHub. AI читает — AI выполняет. Это не теория — это происходит прямо сейчас.\n\n\nЧто делать:\n\nСекреты (.env, ключи, credentials) — в .gitignore и .claudeignore. Всегда\nКлиентские данные — никогда. Используй mock-данные\nКорпоративный код — уточни политику компании\nНезнакомые репозитории — проверяй что AI делает, не давай слепого доступа\n\n\n\n                  \n                  Правило \n                  \n                \n\nОтносись к AI как к публичному Stack Overflow: не пиши туда то, что не готов показать всему интернету.\n\n"},"Second-Brain/Vibe-Coding/VibeCodingTools":{"slug":"Second-Brain/Vibe-Coding/VibeCodingTools","filePath":"Second-Brain/Vibe-Coding/VibeCodingTools.md","title":"Инструменты AI: модели, Skills, MCP, субагенты","links":["Blog/Vibe-Coding/VibeCoding"],"tags":["ai","blog","vibe_coding","tools"],"content":"Инструменты AI: модели, Skills, MCP, субагенты\n\n\n                  \n                  Часть серии I vs AI: мой путь в Vibe Coding\n                  \n                \n\nAI-модели\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nИнструментДля чегоЦенаClaude CodeОсновной: код, дебаг, инфра, рефакторинг~20/150 EUR/месGitHub CopilotНа работе: автодополнение в IDEКорпоративныйChatGPTТексты, брейншторм, быстрые вопросыFreeGeminiGoogle поиск, Аналитика, длинные докиFreeWisprFlowГовори а она пишетFree/ProTelegramЛичный бот в кармане, UI для задачьFreeObsidianЗаписи шизофренииFree\n\nSkills vs MCP vs Субагенты\n\n\n                  \n                  Три инструмента, три разные задачи. Не путай. \n                  \n                \n\nАналогия: ты — шеф-повар ресторана. Claude — твоя кухня.\n\n\nSkills — книга рецептов (учит как делать)\n\n“При код-ревью проверяй: имена по правилам? тесты написаны? nullable обработан?”\nНаписал один раз — работает везде: Claude.ai, Code, API\n\nMCP — кухонная техника (подключает чем делать)\n\nПодключи Sentry — видишь баги\nПодключи Brave — можешь гуглить\nПодключи Supabase — видишь БД\nПодключи Serena — навигация по коду\n\nСубагент — су-шеф (делегирует задачу отдельному агенту)\n\n“Поручи ревью reviewer-агенту”\n“Пусть test-runner прогонит тесты”\nСвой контекст, свои инструменты, своя модель\nТолько Claude Code. Может использовать Haiku (дешевле!)\n\n\n\n                  \n                  Как они работают вместе \n                  \n                \n\nСубагент может использовать Skills как базу знаний\nSkill может вызывать MCP-инструменты: Sentry, Git\nСу-шеф читает рецепт и использует духовку — всё одновременно.\n\n\nПравило: Повторяешь одни и те же промпты? Пиши Skill. Нужен внешний сервис? Ставь MCP. Нужна изоляция? Субагент.\nMCP (Model Context Protocol) — “плагины” для AI\nMCP — это способ подключить внешние инструменты к AI. Один протокол — и AI может работать с GitHub, базами данных, браузером и чем угодно.\nПолезные MCP:\n\noraios/serena — GPS навигация по коду. AI видит структуру всего проекта, ищет по символам, экономит токены\n\nНайди где используется UserService\nПокажи все методы класса Auth\n\n\nupstash/context7 — актуальная документация библиотек (а не устаревшая из обучения AI)\n\nКак работает useActionState в React 19?\n\n\nmicrosoft/playwright-mcp — AI управляет браузером: тесты, скриншоты, проверки\n\nХочу попробывать:\n\nSentry — врач для приложения: ошибки из продакшена, стектрейсы, перформанс — AI видит что сломалось и предлагает фикс\nbrave/brave-search-mcp-server — поиск в интернете прямо из AI: свежие статьи, решения, документация\n\nSkills — “навыки” для Claude\nSkills — папки с инструкциями, которые Claude загружает когда нужно. Как книга рецептов: AI не читает всё сразу, а открывает нужный рецепт под задачу.\nClaude сам решает когда активировать skill по описанию задачи. Скажи “Сделай PDF” — pdf skill загрузится автоматически.\nВстроенные от Anthropic\ngithub.com/anthropics/skills (37.5k stars)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkillЧто делаетdocxСоздание и редактирование Word: tracked changes, комменты, таблицыpdfИзвлечение текста, объединение, разделение, OCRpptxPowerPoint: layouts, шаблоны, графики, авто-генерацияxlsxExcel: формулы, форматирование, графики, анализ данныхfrontend-designКрасивый UI без “AI-слопа”. React + Tailwindwebapp-testingТестирование через Playwright: скриншоты, UI-проверкиskill-creatorПомогает создавать свои skills через Q&amp;A мастерВключить: Settings → Capabilities → Code execution + Skills → Toggle нужные → Готово.\nТоповые community skills\nobra/superpowers (40.9k ⭐) — полная методология: Brainstorm → Plan → Implement. Принудительный TDD, YAGNI und DRY, системный дебаг в 4 фазы, code review между задачами.\nComposioHQ/awesome-claude-skills (35k ⭐) — каталог community skills. Connect-plugin подключает Claude к Gmail, Slack, Notion, GitHub и 500+ сервисов.\nlackeyjb/playwright-skill (1.7k ⭐) — Claude сам пишет и запускает Playwright-тесты. Описываешь что проверить словами — он делает.\nblader (1.6 ⭐) — self-learning agent. Claude учится в процессе работы, извлекает паттерны и создаёт skills автоматически. Становится умнее с каждой сессией.\n\n\n                  \n                  Безопасность \n                  \n                \n\nSkills выполняют произвольный код! Устанавливай только от проверенных авторов. Читай SKILL.md перед установкой.\n\n"},"index":{"slug":"index","filePath":"index.md","title":"Русский","links":["Blog/Vibe-Coding/VibeCoding","Second-Brain/Vibe-Coding/VibeCodingContext","Second-Brain/Vibe-Coding/VibeCodingPrompting","Second-Brain/Vibe-Coding/VibeCodingSecurity","Second-Brain/Vibe-Coding/VibeCodingTools"],"tags":[],"content":"Blog/Vibe Coding\n\nI vs AI: мой путь в Vibe Coding\n\nSecond Brain/Vibe Coding\n\nКонтекст, токены и CLAUDE.md\nПромптинг — это навык\nБезопасность при работе с AI\nИнструменты AI: модели, Skills, MCP, субагенты\n"}}